'''

이번 과제에선 슈퍼마켓 물건들의 목록을 만들고, 그  목록을 통해 슈퍼마켓 고객들의 각 요청을 해결해 줄 것입니다.
이 과제는 반드시 1번, 2번 순서대로 진행하셔야 합니다.

'''

#1. 슈퍼마켓 물건 목록 만들기: 다음은 슈퍼마켓의 물건과 그 가격의 목록입니다. 이를 Python의 기초 자료 구조에 저장하세요.

'''

시리얼: 재고 2개에 하나 5000원, 치약: 재고 4개에 하나당 2000원, 감자칩: 재고 0개에 하나당 1500원, 볼펜: 재고 10개에 하나당 700원

'''

#코드를 여기에


#반드시 아래의 stock 변수에 목록 데이터를 담아 주세요.
stock = ?

#2. 고객 요구사항 들어주기: 이제 고객 2명이 질문을 할 것입니다. 질문에 대한 결과를 최대한 짧은 코딩을 통해 자동으로 결과가 나오도록 하세요.


#고객1: 시리얼은 하나에 얼마인가요?


print(stock?, "원")


#고객2: 지금 볼펜 12개를 살 수 있나요? (True, False로 답변)


print(stock?)



